In [1]:
#Import neccessary packages
import pandas as pd
from sqlalchemy import create_engine, Column, Integer, String, DECIMAL, ForeignKey, Date
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship, sessionmaker
import psycopg2

In [57]:
#Read the csv files
df1 = pd.read_csv('addresses.csv')
df2 = pd.read_csv('customers.csv')
df3 = pd.read_csv('categories.csv')
df4 = pd.read_csv('coupons.csv')
df5 = pd.read_csv('credit_cards.csv')
df6 = pd.read_csv('customer_orders.csv')
df7 = pd.read_csv('discounts.csv')
df8 = pd.read_csv('payment_orders.csv')
df9 = pd.read_csv('payments.csv')
df10 = pd.read_csv('product_warehouse.csv')
df11 = pd.read_csv('products.csv')
df12 = pd.read_csv('ratings.csv')
df13 = pd.read_csv('shipping_satisfaction.csv')
df14 = pd.read_csv('shippings.csv')
df15 = pd.read_csv('supplier_orders.csv')
df16 = pd.read_csv('suppliers.csv')
df17 = pd.read_csv('warehouses.csv')

In [3]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/GroupProject'
# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)
# Establish a connection
connection = engine.connect()

In [4]:
df1.head()

,street,city,state,country,zip_code
0,752 Patricia Way Apt. 042,Hillmouth,Montana,Niger,32334
1,61756 Thompson Oval Apt. 572,North Jamesborough,Virginia,Switzerland,60323
2,6977 Shah Throughway,Mercadoport,Maine,Timor-Leste,59239
3,353 Garza Courts Apt. 891,Kennethbury,Oregon,Antarctica (the territory South of 60 deg S),65619
4,46877 Rachel Ville Apt. 299,West Susan,Virginia,Saint Lucia,22105

In [5]:
#Create a new column with incrementing integer numbers for address_id
df1.insert(0, 'address_id', range(1, 1 + len(df1)))

In [6]:
df1.head()

,address_id,street,city,state,country,zip_code
0,1,752 Patricia Way Apt. 042,Hillmouth,Montana,Niger,32334
1,2,61756 Thompson Oval Apt. 572,North Jamesborough,Virginia,Switzerland,60323
2,3,6977 Shah Throughway,Mercadoport,Maine,Timor-Leste,59239
3,4,353 Garza Courts Apt. 891,Kennethbury,Oregon,Antarctica (the territory South of 60 deg S),65619
4,5,46877 Rachel Ville Apt. 299,West Susan,Virginia,Saint Lucia,22105

In [7]:
#Load addresses data to the database
df1.to_sql(name='addresses', con=engine, if_exists='append', index=False)

300

In [8]:
df2.head()

      user_name                      email first_name last_name  address_id
0         ubell   griffithdillon@yahoo.com  Alexandra      Wolf         194
1        noah62        brendan10@yahoo.com     Taylor     Riley         196
2     zcampbell        sally94@hotmail.com    Michael   Harding         263
3  anthonywendy         dyerchad@yahoo.com   Jennifer     Lynch         120
4      ftrevino  suzannemosley@hotmail.com  Francisco     Avila         167

In [9]:
#Create a new column with incrementing integer numbers for customer_id
df2.insert(0, 'customer_id', range(1, 1 + len(df2)))

In [10]:
df2.head()

,customer_id,user_name,email,first_name,last_name,address_id
0,1,ubell,griffithdillon@yahoo.com,Alexandra,Wolf,194
1,2,noah62,brendan10@yahoo.com,Taylor,Riley,196
2,3,zcampbell,sally94@hotmail.com,Michael,Harding,263
3,4,anthonywendy,dyerchad@yahoo.com,Jennifer,Lynch,120
4,5,ftrevino,suzannemosley@hotmail.com,Francisco,Avila,167

In [11]:
#Load customers data to the database
df2.to_sql(name='customers', con=engine, if_exists='append', index=False)

300

In [12]:
df3.head()

  category_name
0   Electronics
1      Clothing
2         Books
3          Toys
4          Home

In [13]:
#Create a new column with incrementing integer numbers for category_id
df3.insert(0, 'category_id', range(1, 1 + len(df3)))

In [14]:
df3.head()

   category_id category_name
0            1   Electronics
1            2      Clothing
2            3         Books
3            4          Toys
4            5          Home

In [15]:
#Load categories data to the database
df3.to_sql(name='categories', con=engine, if_exists='append', index=False)

9

In [16]:
df11.head()

,product_name,buyin_price,sell_price,category_id
0,"Ramsey, Phillips and Barnes Lipstick",410.97,463.74,9
1,"Cole, Carter and Myers Dumbbells",232.04,292.90,8
2,"Smith, Boone and Johnson Cooking Book",55.99,64.19,3
3,"Gonzales, Montoya and Baldwin Electric Kettle",13.89,17.06,5
4,"Petty, Patterson and Dorsey GPS Navigator",271.36,309.08,7

In [17]:
#Create a new column with incrementing integer numbers for product_id
df11.insert(0, 'product_id', range(1, 1 + len(df11)))

In [18]:
df11.head()

,product_id,product_name,buyin_price,sell_price,category_id
0,1,"Ramsey, Phillips and Barnes Lipstick",410.97,463.74,9
1,2,"Cole, Carter and Myers Dumbbells",232.04,292.90,8
2,3,"Smith, Boone and Johnson Cooking Book",55.99,64.19,3
3,4,"Gonzales, Montoya and Baldwin Electric Kettle",13.89,17.06,5
4,5,"Petty, Patterson and Dorsey GPS Navigator",271.36,309.08,7

In [19]:
#Load products data to the database
df11.to_sql(name='products', con=engine, if_exists='append', index=False)

300

In [20]:
df4.head()

   customer_id  coupon_amount  product_id
0          121          33.64         227
1          160          15.19         141
2           50          33.77         180
3           78           6.20         140
4          150          35.91          20

In [21]:
#Create a new column with incrementing integer numbers for coupon_id
df4.insert(0, 'coupon_id', range(1, 1 + len(df4)))

In [22]:
df4.head()

   coupon_id  customer_id  coupon_amount  product_id
0          1          121          33.64         227
1          2          160          15.19         141
2          3           50          33.77         180
3          4           78           6.20         140
4          5          150          35.91          20

In [23]:
#Load coupons data to the database
df4.to_sql(name='coupons', con=engine, if_exists='append', index=False)

100

In [24]:
df6.head()

   product_id  quantity    price                 date  customer_id
0         216        10  4267.80  2023-08-01 09:56:29          260
1         140         9  5162.22  2023-10-09 20:42:17           78
2         274        10  3589.50  2024-07-11 08:33:30          189
3         182         6  1568.04  2023-12-30 05:36:16          227
4         269         4   788.80  2024-01-12 02:19:17            7

In [25]:
#Create a new column with incrementing integer numbers for order_id
df6.insert(0, 'order_id', range(1, 1 + len(df6)))

In [26]:
df6.head()

   order_id  product_id  quantity    price                 date  customer_id
0         1         216        10  4267.80  2023-08-01 09:56:29          260
1         2         140         9  5162.22  2023-10-09 20:42:17           78
2         3         274        10  3589.50  2024-07-11 08:33:30          189
3         4         182         6  1568.04  2023-12-30 05:36:16          227
4         5         269         4   788.80  2024-01-12 02:19:17            7

In [27]:
#Load customer_order data to the database
df6.to_sql(name='customer_order', con=engine, if_exists='append', index=False)

300

In [28]:
df7.head()

   product_id  discount_percentage starting_time ending_time
0         120                   15    2024-06-30  2024-07-24
1         198                   35    2024-07-15  2024-07-25
2         195                   15    2024-07-30  2024-08-15
3         261                   35    2024-07-26  2024-08-14
4         160                   15    2024-07-08  2024-07-23

In [29]:
#Create a new column with incrementing integer numbers for discount_id
df7.insert(0, 'discount_id', range(1, 1 + len(df7)))

In [30]:
df7.head()

   discount_id  product_id  discount_percentage starting_time ending_time
0            1         120                   15    2024-06-30  2024-07-24
1            2         198                   35    2024-07-15  2024-07-25
2            3         195                   15    2024-07-30  2024-08-15
3            4         261                   35    2024-07-26  2024-08-14
4            5         160                   15    2024-07-08  2024-07-23

In [31]:
#Load discounts data to the database
df7.to_sql(name='discounts', con=engine, if_exists='append', index=False)

100

In [32]:
df9.head()

   payment_id    payment_method
0           1     Bank Transfer
1           2       Credit Card
2           3  Cash on Delivery
3           4            PayPal
4           5            PayPal

In [33]:
#Load payments data to the database
df9.to_sql(name='payments', con=engine, if_exists='append', index=False)

300

In [34]:
df8.head()

   payment_id  order_id
0          51       244
1         140        21
2         206        49
3         219       231
4         132        41

In [35]:
#Drop duplicated rows
df8.drop_duplicates(subset=['payment_id', 'order_id'], inplace=True)
#Load payment_orders data to the database
df8.to_sql(name='payment_orders', con=engine, if_exists='append', index=False)

299

In [36]:
df5.head()

   payment_id  credit_card_number
0           2        1.469440e+15
1           4        9.624390e+15
2           5        3.652530e+15
3           6        5.787190e+15
4           7        5.329370e+15

In [37]:
#Load credit_cards data to the database
df5.to_sql(name='credit_cards', con=engine, if_exists='append', index=False)

149

In [38]:
df17.head()

   address_id   sqft
0         142  20029
1         281  33439
2           7  32203
3          54  39554
4          53   7914

In [39]:
#Create a new column with incrementing integer numbers for warehouse_id
df17.insert(0, 'warehouse_id', range(1, 1 + len(df17)))

In [40]:
df17.head()

   warehouse_id  address_id   sqft
0             1         142  20029
1             2         281  33439
2             3           7  32203
3             4          54  39554
4             5          53   7914

In [42]:
#Load warehouses data to the database
df17.to_sql(name='warehouses', con=engine, if_exists='append', index=False)

10

In [43]:
df10.head()

   product_id  warehouse_id  storage_amount
0         192            10             948
1          50            10             669
2         232            10             899
3          56             8             231
4          53             1             238

In [45]:
#Load product_warehouse data to the database
df10.to_sql(name='product_warehouse', con=engine, if_exists='append', index=False)

300

In [46]:
df12.head()

,customer_id,order_id,rating,feedback
0,290,249,4,Great value for the price; the quality is exce...
1,258,23,3,"The delivery was late, and the package was sli..."
2,229,138,1,"There was a mix-up with the delivery, and it t..."
3,143,87,3,Great value for the price; the quality is exce...
4,178,257,1,The product arrived with defects; it does not ...

In [47]:
#Load ratings data to the database
df12.to_sql(name='ratings', con=engine, if_exists='append', index=False)

300

In [48]:
df14.head()

   order_id  shipping_company  delivery_time
0        31              USPS              9
1       261             FedEx             13
2       265              USPS             13
3        31  Amazon Logistics              6
4        41             FedEx              2

In [49]:
#Create a new column with incrementing integer numbers for shipping_id
df14.insert(0, 'shipping_id', range(1, 1 + len(df14)))

In [50]:
df14.head()

   shipping_id  order_id  shipping_company  delivery_time
0            1        31              USPS              9
1            2       261             FedEx             13
2            3       265              USPS             13
3            4        31  Amazon Logistics              6
4            5        41             FedEx              2

In [51]:
#Load shippings data to the database
df14.to_sql(name='shippings', con=engine, if_exists='append', index=False)

300

In [53]:
df13.head()

   shipping_id  rating                                           feedback
0          167       3  The delivery was okay, but I wish there were m...
1          148       4  Great experience! The courier was friendly, an...
2          161       4  I was impressed with the secure packaging and ...
3          218       1  The delivery was delayed without any explanati...
4          157       2  The courier was rude and left the package at t...

In [58]:
#Drop duplicated values
df13 = df13.drop_duplicates(subset=['shipping_id'])

In [59]:
#Load shipping_satisfaction data to the database
df13.to_sql(name='shipping_satisfaction', con=engine, if_exists='append', index=False)

188

In [60]:
df16.head()

,company_name,email,phone_number,address_id
0,"Brown, Rose and Jones",davisjoseph@gmail.com,(262)731-3737,271
1,Carrillo Group,aanderson@gmail.com,(877)194-2351,136
2,Barnes LLC,garciabrandi@gmail.com,(782)435-3743,2
3,Wells Ltd,timothy84@yahoo.com,(476)379-4466,93
4,"Mccarthy, Morrow and Robinson",maldonadoalice@gmail.com,(381)753-5219,158

In [61]:
#Create a new column with incrementing integer numbers for supplier_id
df16.insert(0, 'supplier_id', range(1, 1 + len(df16)))

In [62]:
df16.head()

,supplier_id,company_name,email,phone_number,address_id
0,1,"Brown, Rose and Jones",davisjoseph@gmail.com,(262)731-3737,271
1,2,Carrillo Group,aanderson@gmail.com,(877)194-2351,136
2,3,Barnes LLC,garciabrandi@gmail.com,(782)435-3743,2
3,4,Wells Ltd,timothy84@yahoo.com,(476)379-4466,93
4,5,"Mccarthy, Morrow and Robinson",maldonadoalice@gmail.com,(381)753-5219,158

In [63]:
#Load shipping_satisfaction data to the database
df16.to_sql(name='suppliers', con=engine, if_exists='append', index=False)

50

In [64]:
df15.head()

   supplier_id  product_id  quantity     price        date
0           39         295       129   5171.61  2023-11-28
1           34         260        53   5849.61  2023-11-19
2           36         251       163   2436.85  2024-02-02
3           47          74       197  41561.09  2023-08-13
4           10         229        57   2233.26  2023-10-24